{"pageProps":{"locale":"es","dict":{"navbar":{"about":"Acerca de mi","skills":"Habilidades","experience":"Experiencia","contact":"Contacto","label_languages":"Idiomas"},"about_view":{"section":"Acerca de mi","title":"Soy Pablo Fuentes, ¡gusto en conocerte!","body":["Soy un ingeniero electrónico y desarrollador de software autodidacta apasionado por aprender nuevas cosas. Me gusta desafiarme y la forma en la que eso me lleva a mejorar mis habilidades de programación. Esa es la razón por la cual comencé a desarrollar algunas apps como freelancer y creé mi propio proyecto llamado Otter Feeder.","Considerando que las tecnologías de software y los patrones de programación cambian constantemente, siempre estoy abierto a estudiarlos y así expandir mis habilidades."]},"skills_view":{"section":"Habilidades técnicas","skill_groups":["Desarrollo de software embebido","Desarrollo Backend","Desarrollo Móvil","Desarrollo Web","Bases de datos","Control de versiones","Sistemas operativos"]},"experience_view":{"section":"Experiencia","jobs":[{"title":"Desarrollador de Software (Freelancer)","company":"Altiro Delivery","date_range":"Junio 2020 - febrero 2021","place":"Santiago, Chile","image":"images/altiro_driver.png","details":["Desarrollo de un servidor en Go que maneja solicitudes de entrega de clientes y provee la ruta más eficiente para los conductores.","Construcción de una interfaz gráfica interna para manejar los pedidos de encomiendas.","Desarrollo de una aplicación móvil en Flutter para los conductores. Despliegue de la app en App Store y Play Store."]},{"title":"Desarrollador de Software (Freelancer)","company":"Laboratorio de Larvas DPKSUR S.A.","date_range":"Diciembre 2020","place":"Huaquillas, Ecuador","image":"images/otter_wave_table.png","details":["Desarrollo de una app en Flutter que muestra tabla de mareas digital para el sector camaronero en el sur de Ecuador. Despliegue de la app en App Store y Play Store."],"google_play_url":"https://play.google.com/store/apps/details?id=com.ottert.wave_table","app_store_url":"https://apps.apple.com/us/app/tabla-de-mareas/id1663683428?platform=iphone"},{"title":"Contribuidor Open Source","company":"Fyne","date_range":"Enero 2021 - noviembre 2021","place":"","image":"images/fyne.png","details":["Solución de algunos bugs gráficos, race conditions, fugas de memoria y pruebas con fallos intermitentes.","Unificación de gran parte del código común usado en los drivers de Escritorio y Móviles.","Propuesta de una nueva apariencia de widgets siguiendo las especificaciones de Material Design."]},{"title":"Desarrollador de Software (Freelancer)","company":"Aso&Cam","date_range":"Junio 2021 - enero 2022","place":"Huaquillas, Ecuador","image":"images/asocam_app.png","details":["Construcción de un servidor GraphQL en Go que maneje los productos, los pedidos y las cuentas de los clientes de Aso&Cam.","Desarrollo de una aplicación móvil “storefront” en Flutter que muestra todos los productos de Aso&Cam.","Despliegue de la app en App Store y Play Store."],"google_play_url":"https://play.google.com/store/apps/details?id=com.asocam.app","app_store_url":"https://apps.apple.com/us/app/asocam/id1600166068"},{"title":"Alimentador Automático para Camarones - Otter Feeder","company":"Otter Technologies con Laboratorio de Larvas DPKSUR S.A.","date_range":"Desde Julio 2021","place":"Machala, Ecuador","image":"images/otter_feeder.png","details":["Construcción de herramientas internas en Go para facilitar el manejo de los dispositivos desplegados (alimentadores).","Desarrollo del circuito núcleo del alimentador alrededor del microcontrolador STM32G0.","Desarrollo del firmware del dispositivo en C que permite al dispositivo trabajar automáticamente siguiendo un horario que es establecido por el usuario a través de Bluetooth LE.","Desarrollo de una aplicación de usuario en Flutter que permite a los clientes configurar sus dispositivos de acuerdo a sus necesidades.","Despliegue de la aplicación de usuario en App Store y Play Store."],"google_play_url":"https://play.google.com/store/apps/details?id=com.ottert.feeder","app_store_url":"https://apps.apple.com/us/app/otter-feeder/id1579728272"}]},"footer":{"developed_by":"Desarrollado por"}}},"__N_SSG":true}